{
  "name": "Michael Armitage",
  "imageSource": "./assets/me.png",
  "address": "16 Links Way, Benfleet, Essex SS7 2ER",
  "phoneNumber": "+44 (0)7810 804912",
  "email": "m17kea@gmail.com",
  "jobTitle": "SENIOR SOLUTIONS ARCHITECT",
  "aboutMe": "I have been mad about computers since I played around with DOS on my first Amstrad. I build them, program them and am fascinated by them. My biggest regret was listening to my dad in 2001 when I announced my intention to study Computer Science and being told the dot com crash had ended the industry. I was that naive 18 year old!  Luckily the force was too strong and after completing a very complicated maths degree, it was my computer skills that shone and led me to become the engineer I am today. I started my career doing data entry and decided I could automate my job, so I did. Far from losing my job I became the most in-demand employee in the department. I have taken that spirit with me through my entire career and have been rewarded with success and the praise of my peers.",
  "experiences": [
    {
      "company": "Sequel Business Solutions",
      "location": "London",
      "position": "Solutions Architect",
      "periodOfWork": "JANUARY 2016 - PRESENT",
      "companyIntro": "Sequel has grown from being a trusted consultancy to becoming a leading insurance and reinsurance software specialist. Headquartered in London EC2, Sequel employs talented insurance and technical experts who understand the market and the related businesses. Sequel deliver a modern, powerful suite of software which provide full end-to-end management of all insurance and reinsurance business. Their clients are able to grow and better manage their business through greater efficiency, flexibility, and data governance.",
      "projects": [
        {
          "projectName": "DEVOPS",
          "projectIntro": "When I joined Sequel they were using several different source control, build, test, deployment and project management systems which slowed velocity and impacted quality. I have lead the formation of a new strategy which is being rolled out across the company.",
          "projectStack": "TFS, Git, Powershell, C#, XAML",
          "projectComponents": [
            "Presented management cost benefit analysis of a unified system",
            "Won approval for a new virtualised server cluster",
            "Introduced the latest version of Microsoft TFS",
            "Moved build, test and deployment strategies to the new vNext build and release management in TFS",
            "Introduced infrastructure-as-code and templated deployment scripts to build servers and configure application requirements automatically",
            "Automated spin up/down of build and test farm of hundreds of servers",
            "Automated in-house deployments",
            "Developed a generic deployment tool for external deployments that could be configured for any product using XML",
            "Formalised Scrum, sprints and sprint planning strategies",
            "Developed a testing reporting framework for product owners"
          ]
        },
        {
          "projectName": "CLAIMS",
          "projectIntro": "Claims is one of the newest products at Sequel and in its short life has become one of the most popular. However, due to the speed at which it was engineered a lot of technical debt had built up and the products stability was very poor. This had led to client complaints and I was assigned to lead the development team and get quality under control. ",
          "projectStack": "TFS, Git, Powershell, C#, Typescript, Angular.js, Selenium, Jasmin",
          "projectComponents": [
            "Educated the team on the formal Scrum methodology",
            "Educated the team on clean coding and SOLID design principles ",
            "Assumed the role of Scrum master and concentrated primarily on removing hindrances to productivity",
            "Assigned a product owner to lead priorities of bug fixes and new requirements to maximise client satisfaction",
            "Enforced daily standups to encourage communication and understanding of product goals for the development team",
            "Implemented a feature branch and pull request process to ensure code could not be merged into the product without passing 100% of tests ",
            "Implemented continuous delivery to build, test and deploy Claims automatically ",
            "Implemented parallel testing capabilities to reduce overall test times, providing feedback to developers 5 times faster than before",
            "Provided architectural guidance for the junior developers by pair programming with them ",
            "Introduced a Selenium testing framework to automate manual regression testing ",
            "Developed, using my generic installation tool, a installation wizard for client installs that automated deployments externally and removed the need for a 10 page installation document",
            "Implemented code analysis tools to measure code quality and levels of technical debt",
            "Dramatically increased velocity and the overall quality of the product "
          ]
        }
      ]
    },
    {
      "company": "BRT",
      "location": "London",
      "position": "Agile Team Leader",
      "periodOfWork": "NOVEMBER 2013 - JANUARY 2016",
      "projectIntro": "BRT is a multi-award winning provider of business process outsourcing and bespoke software solutions for wealth managers, independent asset managers, funds, private banks and trust companies.",
      "projects": [
        {
          "projectName": "DEVOPS",
          "projectIntro": "When I joined BRT there was no source control, no concept of project management and no devops. These were the first things that I put in place.",
          "projectStack": "Redmine, Gitlab, Thoughtworks Go",
          "projectComponents": [
            "Introduced Scrum, sprints and sprint planning",
            "Introduced Project management (Redmine), source control (Gitlab) and &nbsp;continuous integration (Thoughtworks Go)",
            "Discouraged outsourcing in favour of co-location ",
            "Introduced code reviews and style guides"
          ]
        },
        {
          "projectName": "CUSTODIAN DATA",
          "projectIntro": "BRT&rsquo;s clients receive data files from many sources containing transaction, position and market data. The purpose of the project was to simplify the gathering, extraction and processing of this data.",
          "projectStack": "Windows services, C#, Entity Framework, Autofac, SqlServer.Smo, QuickFix",
          "projectComponents": [
            "Code-first Entity framework database for FTP and file extraction configuration",
            "Replaced SSIS with Delimited, XML and Excel to SQL translators",
            "Rule based data translator to unify transaction data and position data for automated transaction entry and reconciliation",
            "FIX protocol communication for trade confirmations",
            "Trade posting services to multiple portfolio management systems"
          ]
        },
        {
          "projectName": "FUND DEALING DATABASE",
          "projectIntro": "BRT&rsquo;s clients trade mainly in funds and require reliable centralised dealing information about a funds dealing times, minimum subscriptions and many other data points.",
          "projectStack": "C#, Entity Framework, Autofac, Web Api, Breeze.js, Require.js, Angular.js, Typescript, HTML5, Less ",
          "projectComponents": [
            "Code-first database to house data relating funds",
            "N-tier architecture with database, data access, business logic and api layers &nbsp;"
          ]
        },
        {
          "projectName": "CLIENT REPORTING",
          "projectIntro": "BRT&rsquo;s client reporting solutions were engineered on a client by client basis and there was no consistency between entities and the databases driving them. The purpose of this project was to create a unified reporting database that could be populated from any of the three portfolio management systems in use and any future ones.",
          "projectStack": "Windows services, C#, Entity Framework, Autofac, Web Api, SSRS",
          "projectComponents": [
            "Code-first database to house data relating to CRM, portfolios, instruments, pricing, trading, reporting, reconciliation and user workflow",
            "N-tier architecture with database, data access, business logic and api layers &nbsp;",
            "Generic task running platform to allow blocks of code to be run in a workflow with set sequences &amp; priorities to monitor &amp; maintain performance calculation and report data extraction",
            "Generic sync tool to gather data from the legacy system"
          ]
        },
        {
          "projectName": "SINGLE SIGN-ON",
          "projectIntro": "BRT&rsquo;s legacy systems had individual authentication and role management systems. The purpose of this project was to create a single sign-on application that handled authentication and role management across all existing and future BRT applications.",
          "projectStack": "C#, Entity Framework, Autofac, Web Api, ASP.Net Identity, Thinktecture IdentityServer, WebApi, MVC, Razor",
          "projectComponents": [
            "Implemented Thinktecture&rsquo;s identity server version 2",
            "Upgraded to version 3 in 2015"
          ]
        },
        {
          "projectName": "CLIENT REPORTING PORTAL",
          "projectIntro": "Leveraging the client reporting database and single sign-on I created a prototype for a client portal for our client&rsquo;s clients. This was quickly marketed as our flagship new offering.",
          "projectStack": "&nbsp;Breeze.js, Require.js, Angular.js, Typescript, HTML5, Less ",
          "projectComponents": [
            "HTML client reports ",
            "Documents portal",
            "Manager chat"
          ]
        }
      ]
    },
    {
      "company": "Stanhope Capital",
      "location": "London",
      "position": "Senior Developer",
      "periodOfWork": "JULY 2008 - OCTOBER 2013",
      "projectIntro": "Stanhope Capital is a global investment office providing investment management and advisory services to private clients, charities and endowments. Based in London, Geneva, and Jersey, Stanhope is now one of the largest private investment offices in Europe, overseeing over $9.5bn in assets.",
      "projects": [
        {
          "projectStack": "&nbsp;VBA, C#, LINQ to SQL, MVC, Razor, jQuery, Javascript, HTML5, CSS, SQL, SSRS, SSIS",
          "projectComponents": [
            "APX portfolio management system implementation",
            "Client Reporting ",
            "Reconciliation",
            "Bloomberg price feeds",
            "Transaction loaders ",
            "MIS views",
            "Trading platform with order management"
          ]
        }
      ]
    },
    {
      "company": "Bluecrest",
      "location": "London",
      "position": "Associate Middle-Office Derivatives",
      "periodOfWork": "JULY </span><span>2006 - JULY 2008",
      "projectIntro": "BlueCrest Capital Management Limited is an alternative asset management business based in Jersey, managing significant institutional assets across a number of diversified strategies.",
      "projects": [
        {
          "projectStack": "VBA, VB.Net, SQL",
          "projectComponents": [
            "Future reconciliation ",
            "Future and option expiry automation",
            "Broker fee automation",
            "Electronic blotter",
            "Electronic broker confirmation "
          ]
        }
      ]
    },
    {
      "company": "JP Morgan Asset Management",
      "position": "Data Analyst",
      "periodOfWork": "JANUARY 2005 - JULY 2006",
      "projectIntro": "J.P. Morgan Asset Management is a leading asset manager for individuals, advisors and institutions. It is one of the largest asset and wealth managers in the world, with assets under management of $1.7 trillion.",
      "projects": [
        {
          "projectStack": "VBA",
          "projectComponents": [
            "Static data entry automation ",
            "Future reconciliation"
          ]
        }
      ]
    }
  ],
  "skillSections": [
    {
      "sectionName": "Languages",
      "sectionList": [
        "C#",
        "SQL",
        "VB.Net",
        "Typescript"
      ]
    },
    {
      "sectionName": "Libraries",
      "sectionList": [
        "Entity Framework",
        "ASP.Net Identity",
        "Autofac",
        "Breeze.js",
        "Require.js",
        "Angular.js",
        "Less"
      ]
    },
    {
      "sectionName": "Design principles",
      "sectionList": [
        "Single responsibility",
        "Open/Closed",
        "Liskov substitution",
        "Interface segregation",
        "Dependency inversion"
      ]
    },
    {
      "sectionName": "Development tools",
      "sectionList": [
        "Visual Studio",
        "GIT",
        "NPM",
        "Webpack",
        "Bower",
        "Grunt",
        "Gulp"
      ]
    }
  ],
  "education": [
    {
      "company": "City University",
      "location": "London",
      "course": "BSc Actuarial Science with Honours",
      "periodOfWork": "SEPTEMBER 2001 - JUNE 2004",
      "projectIntro": "The BSc (Hons) Actuarial Science degree at City University is the longest established Actuarial Science degree in England, it offers a sound education in actuarial and financial studies, as well as mathematics, statistics and information technology. The degree involves the application of quantitative skills to problems in finance that normally involve risk or uncertainty. "
    },
    {
      "company": "South East Essex Sixth Form College",
      "location": "Benfleet, Essex",
      "course": "A-Levels",
      "periodOfWork": "SEPTEMBER 1999 - JUNE 2001",
      "projectIntro": "Maths [A], Further Maths [B], Physics [B], Computing [D funny story]"
    }
  ],
  "referenceQuote": "References available by request"
}